=begin
      RGSS3
      
      ★ 自動ニューゲーム ★
      
      セーブファイルが存在しない場合、
      タイトル画面を飛ばして自動的にニューゲームを実行します。
      
      ver1.10
      
      Last Update : 2012/03/29
      03/29 : 初回起動時以外は機能を制限する設定項目を追加
      ----------------------2012--------------------------
      12/17 : RGSS2からの移植
      ----------------------2011--------------------------
      
      ろかん　　　http://kaisou-ryouiki.sakura.ne.jp/
=end

#===========================================
#   設定箇所
#===========================================
module AutoNewGame
  # 初回起動時以外(メニューのタイトルへ戻るやゲームオーバー時)は、
  # セーブファイルが存在しない場合であってもタイトル画面を表示する
  FSS = true
end
#===========================================
#   ここまで
#===========================================

$rsi ||= {}
$rsi["自動ニューゲーム"] = true

class Scene_Title < Scene_Base
  #--------------------------------------------------------------------------
  # ● メイン
  #--------------------------------------------------------------------------
  def main
    if DataManager.save_file_exists? || $first_start_setup
      super
    else
      SceneManager.clear
      Graphics.freeze
      auto_new_game
    end
    $first_start_setup = AutoNewGame::FSS
  end
  #--------------------------------------------------------------------------
  # ● 自動ニューゲーム
  #--------------------------------------------------------------------------
  def auto_new_game
    DataManager.setup_new_game
    $game_map.autoplay
    SceneManager.goto(Scene_Map)
  end
end