#==============================================================================
# ■ マップ名の非表示を修正 (VX Ace用)
#------------------------------------------------------------------------------
# 製作者     : CanariAlternate
# サイト名   : カルトの鳥篭
# サイトURL  : http://canarialt.blog.fc2.com
#------------------------------------------------------------------------------
# ■ 概要 : マップ名の表示を"非表示"で場所移動した際にその直後に"表示"に設定すると
#           マップ名が表示されてしまう問題を修正する。
#
# ■ 必須 :  なし
#
#■ 位置 : 「Window_MapName」より下

#     $game_map.name_display = true


#------------------------------------------------------------------------------
# 更新履歴 : 2012/12/30 Ver1.00 スクリプトを作成した。
#            2013/02/19 Ver1.01 共通処理スクリプトの廃止による変更を施した。
#==============================================================================

$imported ||= {}
$imported[:CanariAlternate_MapNameBug_Patch] = true

#==============================================================================
# ■ Window_MapName
#------------------------------------------------------------------------------
# 　マップ名を表示するウィンドウです。
#==============================================================================
class Window_MapName < Window_Base
  #--------------------------------------------------------------------------
  # ● フレーム更新 [追加]
  #--------------------------------------------------------------------------
  alias update_MapNameBug_Patch update
  def update
    update_MapNameBug_Patch
    @show_count = 0 unless $game_map.name_display
  end
end