=begin ************************************************************************
  ◆ 回転式バトルコマンド Ver.1.11
  ---------------------------------------------------------------------------
    バトルコマンドを回転式アイコンコマンドに変更します。
=end # ************************************************************************

#-information------------------------------------------------------------------
$ziifee ||= {}
$ziifee[:RollBattleCommand] = true
#------------------------------------------------------------------------------
#-memo-------------------------------------------------------------------------
#  [必要スクリプト]
#    画像コマンドスクリプト (Ver.1.50以上)
#  [必要画像] 以下の画像を Graphics/System にインポートしてください。
#    バトルコマンド用背景画像 ( ファイル名 : Ring96x88 )
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
#  このスクリプトは、画像コマンドスクリプトの下に入れてください。
#  アイコンの変更は、画像コマンドスクリプトの中で行えます。
#------------------------------------------------------------------------------

module ZiifRollBattleCommand
  # ▼ コマンド表示後に表示位置を調整する ( true / false )
  AdjustPartyWindow = true      # パーティウィンドウ
  AdjustActorWindow = true      # アクターウィンドウ
end

#******************************************************************************
# ▼ 回転式コマンド導入部
#******************************************************************************

class Window_PartyCommand; include ZiifSpriteCommand_RollIcon; end
class Window_ActorCommand; include ZiifSpriteCommand_RollIcon; end

#******************************************************************************
# ▼ レイアウト部
#******************************************************************************

#==============================================================================
# ■ Sprite_ZiifRollIconActorBattleCommand
#==============================================================================

class Sprite_ZiifRollIconActorBattleCommand < Sprite_ZiifRollIconCommand
  #--------------------------------------------------------------------------
  # ● アイコン番号の取得
  #--------------------------------------------------------------------------
  def icon_index
    if command_set.command_symbol(self.index) == :attack
      return command_set.attack_icon_index
    end
    return super
  end
end

#==============================================================================
# ■ Window_PartyCommand
#==============================================================================

class Window_PartyCommand
  #--------------------------------------------------------------------------
  # ● 幅の取得
  #--------------------------------------------------------------------------
  def window_width
    return 96
  end
  #--------------------------------------------------------------------------
  # ● 高さの取得
  #--------------------------------------------------------------------------
  def window_height
    return 88
  end
  #--------------------------------------------------------------------------
  # ● 背景画像のファイル名を取得
  #--------------------------------------------------------------------------
  def background_filename
    return "Ring96x88"
  end
end

#==============================================================================
# ■ Window_ActorCommand
#==============================================================================

class Window_ActorCommand
  #--------------------------------------------------------------------------
  # ● 幅の取得
  #--------------------------------------------------------------------------
  def window_width
    return 96
  end
  #--------------------------------------------------------------------------
  # ● 高さの取得
  #--------------------------------------------------------------------------
  def window_height
    return 88
  end
  #--------------------------------------------------------------------------
  # ● 背景画像のファイル名を取得
  #--------------------------------------------------------------------------
  def background_filename
    return "Ring96x88"
  end
  #--------------------------------------------------------------------------
  # ● スプライトコマンドクラスの取得
  #--------------------------------------------------------------------------
  def sprite_command_class
    return Sprite_ZiifRollIconActorBattleCommand
  end
  #--------------------------------------------------------------------------
  # ● 攻撃アイコン番号を取得
  #--------------------------------------------------------------------------
  def attack_icon_index
    if @actor && !@actor.weapons.compact.empty?
      return @actor.weapons.compact.first.icon_index
    end
    ZiifManager::IconSet[:attack][nil]
  end
end

#==============================================================================
# ■ Scene_Battle
#==============================================================================

class Scene_Battle
  #--------------------------------------------------------------------------
  # ● パーティコマンドウィンドウの作成
  #--------------------------------------------------------------------------
  alias :ziif_roll_battle_command_create_party_command_window :create_party_command_window
  def create_party_command_window
    ziif_roll_battle_command_create_party_command_window
    if ZiifRollBattleCommand::AdjustPartyWindow
      @party_command_window.x += 64
      @party_command_window.y += 60
    end
  end
  #--------------------------------------------------------------------------
  # ● アクターコマンドウィンドウの作成
  #--------------------------------------------------------------------------
  alias :ziif_roll_battle_command_create_actor_command_window :create_actor_command_window
  def create_actor_command_window
    ziif_roll_battle_command_create_actor_command_window
    if ZiifRollBattleCommand::AdjustActorWindow
      @actor_command_window.x += 64
      @actor_command_window.y += 60
    end
  end
end

