#==============================================================================
# □ XP画面サイズ：[メッセージウィンドウ調整]（for VX Ace）
#------------------------------------------------------------------------------
# Version : 1_20130317
# by サリサ・タイクーン　提案・構築：Faru様
# http://www.tycoon812.com/rgss/
# http://hengenroku.blog.fc2.com/（Faru様）
#==============================================================================

#==============================================================================
# □ 素材スイッチ
#==============================================================================
$rgsslab = {} if $rgsslab == nil
$rgsslab["XP画面サイズ：[メッセージウィンドウ調整]"] = true

if $rgsslab["XP画面サイズ：[メッセージウィンドウ調整]"]

#==============================================================================
# □ カスタマイズポイント
#==============================================================================
module RGSSLAB end
module RGSSLAB::XP_Display_Size_Message_Window_Adjustment
  #--------------------------------------------------------------------------
  # ○ ウィンドウの幅の設定
  #    ウィンドウの幅を調整します。
  #
  #    RPGツクールVX Aceの標準は544です。
  #--------------------------------------------------------------------------
  WIDTH = 640
end

# カスタマイズポイントは、ここまで

#==============================================================================
# □ RGSSLAB::XP_Display_Size_Message_Window_Adjustment [module]
#==============================================================================
module RGSSLAB::XP_Display_Size_Message_Window_Adjustment
  #--------------------------------------------------------------------------
  # ○ 素材設定用の定数定義
  #--------------------------------------------------------------------------
  MATERIAL_NAME = "XP画面サイズ：[メッセージウィンドウ調整]"
  VERSION       = 1
  RELEASE       = 20130317
end

#==============================================================================
# ■ Window_Message [class]
#==============================================================================
class Window_Message < Window_Base
  #--------------------------------------------------------------------------
  # ○ モジュールの設定
  #--------------------------------------------------------------------------
  RGSSLAB_023_01 = RGSSLAB::XP_Display_Size_Message_Window_Adjustment
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化 [再定義]
  #--------------------------------------------------------------------------
  def initialize
    super(window_x, 0, window_width, window_height)
    self.z = 200
    self.openness = 0
    create_all_windows
    create_back_bitmap
    create_back_sprite
    clear_instance_variables
  end
  #--------------------------------------------------------------------------
  # ○ ウィンドウの横の位置
  #--------------------------------------------------------------------------
  def window_x
    (Graphics.width - window_width) / 2
  end
  #--------------------------------------------------------------------------
  # ○ ウィンドウの幅の位置
  #--------------------------------------------------------------------------
  def window_width
    RGSSLAB_023_01::WIDTH
  end
  #--------------------------------------------------------------------------
  # ● ウィンドウ位置の更新 [再定義]
  #--------------------------------------------------------------------------
  def update_placement
    @position = $game_message.position
    self.y = @position * (Graphics.height - height) / 2
    case $game_message.position
    when 0
      self.y += 32
    when 2
      self.y -= 32
    end
    @gold_window.y = y > 0 ? 0 : Graphics.height - @gold_window.height
    @back_sprite.x = (Graphics.width - width) / 2 if @background == 1
  end
end

end

