#~ #------------------------------------------------------------------------------
#~ #  属性修正値仕様変更
#~ #    バージョン：1.0
#~ #    RGSS3 (RPGツクールVX ACE)
#~ #    作成者：project j
#~ #    配布元：http://jsgamesfactory.web.fc2.com/
#~ #
#~ #  仕　様：与えられた属性の平均値を修正値として返す
#~ #  使い方：スクリプト導入のみ
#~ #
#~ #------------------------------------------------------------------------------

#~ #==============================================================================
#~ # ■ Game_Battler
#~ #------------------------------------------------------------------------------
#~ # 　スプライトや行動に関するメソッドを追加したバトラーのクラスです。このクラス
#~ # は Game_Actor クラスと Game_Enemy クラスのスーパークラスとして使用されます。
#~ #==============================================================================
#~ class Game_Battler < Game_BattlerBase
#~   #--------------------------------------------------------------------------
#~   # ● 属性の最大修正値の取得
#~   #     elements : 属性 ID の配列
#~   #    与えられた属性の中で最も有効な修正値を返す
#~   #--------------------------------------------------------------------------
#~   alias jsscript_elements_max_rate elements_max_rate
#~   def elements_max_rate(elements)
#~     result = 0.0
#~     elements.each {|i| result += element_rate(i)}
#~     return result / elements.size
#~   end
#~ end