#==============================================================================
# ■ Game_Interpreter
#------------------------------------------------------------------------------
# 　イベントコマンドを実行するインタプリタです。このクラスは Game_Map クラス、
# Game_Troop クラス、Game_Event クラスの内部で使用されます。
#==============================================================================

class Game_Interpreter 

#--------------------------------------------------------------------------
# ● 実行
#--------------------------------------------------------------------------
def run
#wait_for_message←ここがコメントアウト
while @list[@index] do
execute_command
@index += 1
end
Fiber.yield
@fiber = nil
end
end