#==============================================================================
# ■ Vocab
#------------------------------------------------------------------------------
# 　用語とメッセージを定義するモジュールです。定数でメッセージなどを直接定義す
# るほか、グローバル変数 $data_system から用語データを取得します。
#==============================================================================
module Vocab
  # 戦闘
  Log          = "ログ"  
end

#==============================================================================
# ■ Game_Temp
#------------------------------------------------------------------------------
# 　セーブデータに含まれない、一時的なデータを扱うクラスです。このクラスのイン
# スタンスは $game_temp で参照されます。
#==============================================================================
class Game_Temp
  #--------------------------------------------------------------------------
  # ● 公開インスタンス変数
  #--------------------------------------------------------------------------
  attr_accessor :log                # ログ
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #--------------------------------------------------------------------------
  alias initialize3 initialize
  def initialize
    initialize3
    @log = []
  end
  #--------------------------------------------------------------------------
  # ● ログの追加
  #--------------------------------------------------------------------------
  def add_log(text)
    @log.push(text) if text != ""
    @log.delete_at(0) if @log.size > 199
  end
end

#==============================================================================
# ■ Game_Message
#------------------------------------------------------------------------------
# 　文章や選択肢などを表示するメッセージウィンドウの状態を扱うクラスです。この
# クラスのインスタンスは $game_message で参照されます。
#==============================================================================
class Game_Message
  #--------------------------------------------------------------------------
  # ● テキストの追加
  #--------------------------------------------------------------------------
  def add(text)
    @texts.push(text)    
    $game_temp.add_log(text)
  end
end

#==============================================================================
# ■ Window_BattleLog
#------------------------------------------------------------------------------
# 　戦闘の進行を実況表示するウィンドウです。枠は表示しませんが、便宜上ウィンド
# ウとして扱います。
#==============================================================================
class Window_BattleLog < Window_Selectable
  #--------------------------------------------------------------------------
  # ● 文章の追加
  #--------------------------------------------------------------------------
  alias add_text2 add_text
  def add_text(text)
    $game_temp.add_log(text)
    add_text2(text)
  end
  #--------------------------------------------------------------------------
  # ● 文章の置き換え
  #    最下行を別の文章に置き換える。
  #--------------------------------------------------------------------------
  alias replace_text2 replace_text
  def replace_text(text)
    $game_temp.add_log(text)
    replace_text2(text)
  end
end

#==============================================================================
# ■ Window_BackLog
#------------------------------------------------------------------------------
# 　戦闘画面でバックログを表示させるウィンドウです。
#==============================================================================
class Window_BackLog < Window_Selectable
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #--------------------------------------------------------------------------
  def initialize(x=0, y=0, width=640, height=480)
    super
    self.opacity = 0
    create_back_bitmap
    create_back_sprite
    refresh   
    self.top_row = $game_temp.log.size - page_row_max
    select(self.top_row)
  end
  #--------------------------------------------------------------------------
  # ● 解放
  #--------------------------------------------------------------------------
  def dispose
    super
    dispose_back_bitmap
    dispose_back_sprite
  end
  #--------------------------------------------------------------------------
  # ● 桁数の取得
  #--------------------------------------------------------------------------
  def col_max
    return 1
  end
  #--------------------------------------------------------------------------
  # ● 項目数の取得
  #--------------------------------------------------------------------------
  def item_max
    $game_temp.log.size
  end
  #--------------------------------------------------------------------------
  # ● リフレッシュ
  #--------------------------------------------------------------------------
  def refresh
    draw_background
    index = 0
    $game_temp.log.each do |log|
      draw_text_ex(4, index*24, log)
      index += 1
    end
  end
  #--------------------------------------------------------------------------
  # ● カーソルの更新
  #--------------------------------------------------------------------------
  def update_cursor
    cursor_rect.empty
  end
  #--------------------------------------------------------------------------
  # ● カーソルの移動可能判定
  #--------------------------------------------------------------------------
  def cursor_movable?
    active && open?
  end
  #--------------------------------------------------------------------------
  # ● 描画位置の取得
  #--------------------------------------------------------------------------
  def draw_raw_top
    item_max - page_row_max
  end
  #--------------------------------------------------------------------------
  # ● カーソルを下に移動
  #--------------------------------------------------------------------------
  def cursor_down(wrap = false)
    self.top_row += 1
    self.top_row = draw_raw_top if self.top_row > draw_raw_top
    select(self.top_row)
  end
  #--------------------------------------------------------------------------
  # ● カーソルを上に移動
  #--------------------------------------------------------------------------
  def cursor_up(wrap = false)
    self.top_row -= 1
    self.top_row = 0 if self.top_row < 0
    select(self.top_row)
  end
  #--------------------------------------------------------------------------
  # ● カーソルを 1 ページ後ろに移動
  #--------------------------------------------------------------------------  
  def cursor_pagedown
    self.top_row += page_row_max
    self.top_row = draw_raw_top if self.top_row > draw_raw_top    
  end
  #--------------------------------------------------------------------------
  # ● カーソルを 1 ページ前に移動
  #--------------------------------------------------------------------------  
  def cursor_pageup
    self.top_row -= page_row_max
    self.top_row = 0 if self.top_row < 0    
  end  
  #--------------------------------------------------------------------------
  # ● カーソルの移動処理
  #--------------------------------------------------------------------------
  def process_cursor_move
    return unless cursor_movable?
    last_index = @index
    cursor_down (Input.trigger?(:DOWN))  if Input.repeat?(:DOWN)
    cursor_up   (Input.trigger?(:UP))    if Input.repeat?(:UP)
    cursor_pagedown   if !handle?(:pagedown) && Input.trigger?(:R)
    cursor_pageup     if !handle?(:pageup)   && Input.trigger?(:L)
    Sound.play_cursor if @index != last_index
  end
  
  #--------------------------------------------------------------------------
  # ● 背景ビットマップの作成
  #--------------------------------------------------------------------------
  def create_back_bitmap
    @back_bitmap = Bitmap.new(width, height)
  end
  #--------------------------------------------------------------------------
  # ● 背景スプライトの作成
  #--------------------------------------------------------------------------
  def create_back_sprite
    @back_sprite = Sprite.new
    @back_sprite.bitmap = @back_bitmap
    @back_sprite.y = y
    @back_sprite.z = z - 1
  end
  #--------------------------------------------------------------------------
  # ● 背景ビットマップの解放
  #--------------------------------------------------------------------------
  def dispose_back_bitmap
    @back_bitmap.dispose
  end
  #--------------------------------------------------------------------------
  # ● 背景スプライトの解放
  #--------------------------------------------------------------------------
  def dispose_back_sprite
    @back_sprite.dispose
  end  
  #--------------------------------------------------------------------------
  # ● 背景の描画
  #--------------------------------------------------------------------------
  def draw_background
    @back_bitmap.clear
    @back_bitmap.fill_rect(back_rect, back_color)
  end
  #--------------------------------------------------------------------------
  # ● 背景のクリア
  #--------------------------------------------------------------------------
  def clear_background
    @back_bitmap.clear
  end
  #--------------------------------------------------------------------------
  # ● 背景の矩形を取得
  #--------------------------------------------------------------------------
  def back_rect
    Rect.new(0, 0, 640, 480)
  end
  #--------------------------------------------------------------------------
  # ● 背景色の取得
  #--------------------------------------------------------------------------
  def back_color
    Color.new(0, 0, 0, back_opacity)
  end
  #--------------------------------------------------------------------------
  # ● 背景の不透明度を取得
  #--------------------------------------------------------------------------
  def back_opacity
    return 64
  end
end

#==============================================================================
# ■ Window_PartyCommand
#------------------------------------------------------------------------------
# 　バトル画面で、戦うか逃げるかを選択するウィンドウです。
#==============================================================================
class Window_PartyCommand < Window_Command
  #--------------------------------------------------------------------------
  # ● コマンドリストの作成
  #--------------------------------------------------------------------------
  alias make_command_list_log make_command_list
  def make_command_list
    make_command_list_log
    add_command(Vocab::Log,    :log)    
  end  
end

#==============================================================================
# ■ Scene_Battle
#------------------------------------------------------------------------------
# 　バトル画面の処理を行うクラスです。
#==============================================================================
class Scene_Battle < Scene_Base
  #--------------------------------------------------------------------------
  # ● 開始処理
  #--------------------------------------------------------------------------
  alias start_log start
  def start
    start_log
    $game_temp.log.clear
  end
  #--------------------------------------------------------------------------
  # ● パーティコマンドウィンドウの作成
  #--------------------------------------------------------------------------
  alias create_party_command_window_log create_party_command_window
  def create_party_command_window
    create_party_command_window_log
    @party_command_window.set_handler(:log, method(:command_log))
    @party_command_window.unselect
  end
  #--------------------------------------------------------------------------
  # ● バックログウィンドウの作成
  #--------------------------------------------------------------------------
  def create_back_log_window
    @back_log_window = Window_BackLog.new
    @back_log_window.set_handler(:ok,     method(:on_log_cancel))
    @back_log_window.set_handler(:cancel, method(:on_log_cancel))
    @back_log_window.deactivate
    @back_log_window.hide
  end
  #--------------------------------------------------------------------------
  # ● ログ［キャンセル］
  #--------------------------------------------------------------------------
  def on_log_cancel
    @back_log_window.deactivate
    @back_log_window.hide
    @back_log_window.clear_background
    @status_window.show
    @party_command_window.activate
    @party_command_window.show
  end
  #--------------------------------------------------------------------------
  # ● コマンド［ログ］
  #--------------------------------------------------------------------------
  def command_log
    @back_log_window.dispose if @back_log_window != nil
    create_back_log_window
    @status_window.hide
    @party_command_window.deactivate
    @party_command_window.hide
    @back_log_window.refresh
    @back_log_window.activate
    @back_log_window.show
  end
end
