#==============================================================================
# 
# ■ 切り替えダッシュスクリプト for RGSS3
# 
# 【内容】
# 　 ボタンを押すごとにダッシュ状態と非ダッシュ状態を切り替えることが
#    できるようになります。
# 
# 【導入方法】
#    スクリプトエディタの「▼ 素材」セクションと「▼ メイン」セクションの間に
#　  全文をコピー＆ペーストしてください。
# 
#==============================================================================

class Game_Player < Game_Character
  #--------------------------------------------------------------------------
  # ● 非公開メンバ変数の初期化（オーバーライド）
  #--------------------------------------------------------------------------
  def init_private_members
    super
    @dash_moving = false
  end
  #--------------------------------------------------------------------------
  # ● ダッシュ状態判定（再定義）
  #--------------------------------------------------------------------------
  def dash?
    return false if @move_route_forcing
    return false if $game_map.disable_dash?
    return false if vehicle
    return @dash_moving
  end
  #--------------------------------------------------------------------------
  # ● フレーム更新（エイリアス）
  #--------------------------------------------------------------------------
  alias uma_update update
  def update
    dash_by_input
    uma_update
  end
  #--------------------------------------------------------------------------
  # ● ボタン入力によるダッシュ処理
  #--------------------------------------------------------------------------
  def dash_by_input
    @dash_moving ^= true if Input.trigger?(:A)
  end
end