#~ #==============================================================================
#~ # □ レベルによる取得経験値増減設定（for VX Ace）
#~ #------------------------------------------------------------------------------
#~ # Version : 1_20120119
#~ # by サリサ・タイクーン
#~ # http://www.tycoon812.com/rgss/
#~ #------------------------------------------------------------------------------
#~ # ※ 正常に扱うには、敵レベル実装 が別途必要です。
#~ #==============================================================================

#~ #==============================================================================
#~ # □ 素材スイッチ
#~ #==============================================================================
#~ $rgsslab = {} if $rgsslab == nil
#~ $rgsslab["レベルによる取得経験値増減設定"] = true

#~ if $rgsslab["レベルによる取得経験値増減設定"]

#~ #==============================================================================
#~ # □ カスタマイズポイント
#~ #==============================================================================
#~ module RGSSLAB end
#~ module RGSSLAB::Get_Exp_UpDown_Setting
#~   #--------------------------------------------------------------------------
#~   # ○ 設定タイプ
#~   #    設定タイプを指定します。
#~   #
#~   #    0 : 通常通り（デフォルト）
#~   #    1 : 最もレベルの高いバトラーとの差
#~   #    2 : 最もレベルの低いバトラーとの差
#~   #    3 : レベルの合計との差
#~   #
#~   #    ・イベントコマンドのスクリプトでの変更方法
#~   #    $game_system.rgsslab132.get_type = 値
#~   #--------------------------------------------------------------------------
#~   TYPE = 1
#~   #--------------------------------------------------------------------------
#~   # ○ 増減の量
#~   #    差があった場合の取得経験値の増減‰の設定です。
#~   #--------------------------------------------------------------------------
#~   UPDOWN = 30
#~   #--------------------------------------------------------------------------
#~   # ○ 最大レート
#~   #    差によって増えた経験値の最大レートの設定です。
#~   #
#~   #    正確には、本来の取得経験値＋増えた経験値（MAX）‰が
#~   #    最大レートとなります。
#~   #--------------------------------------------------------------------------
#~   MAX = 100
#~ end

#~ # カスタマイズポイントは、ここまで

#~ #==============================================================================
#~ # □ RGSSLAB::Get_Exp_UpDown_Setting [module]
#~ #==============================================================================
#~ module RGSSLAB::Get_Exp_UpDown_Setting
#~   #--------------------------------------------------------------------------
#~   # ○ 素材設定用の定数定義
#~   #--------------------------------------------------------------------------
#~   MATERIAL_NAME = "レベルによる取得経験値増減設定"
#~   VERSION       = 1
#~   RELEASE       = 20120119
#~ end

#~ #==============================================================================
#~ # ■ Game_System [class]
#~ #==============================================================================
#~ class Game_System
#~   #--------------------------------------------------------------------------
#~   # ● 公開インスタンス変数
#~   #--------------------------------------------------------------------------
#~   attr_accessor :rgsslab132
#~   #--------------------------------------------------------------------------
#~   # ● オブジェクト初期化 [エイリアス]
#~   #--------------------------------------------------------------------------
#~   alias get_exp_updown_initialize initialize
#~   def initialize
#~     get_exp_updown_initialize
#~     @rgsslab132 = RgssLab_132.new
#~   end
#~ end

#~ #==============================================================================
#~ # □ RgssLab_132 [class]
#~ #==============================================================================
#~ class RgssLab_132
#~   #--------------------------------------------------------------------------
#~   # ○ モジュールの設定
#~   #--------------------------------------------------------------------------
#~   RGSSLAB_132 = RGSSLAB::Get_Exp_UpDown_Setting
#~   #--------------------------------------------------------------------------
#~   # ○ 公開インスタンス変数
#~   #--------------------------------------------------------------------------
#~   attr_accessor :get_type
#~   #--------------------------------------------------------------------------
#~   # ○ オブジェクト初期化
#~   #--------------------------------------------------------------------------
#~   def initialize
#~     @get_type = RGSSLAB_132::TYPE
#~   end
#~ end

#~ #==============================================================================
#~ # ■ Game_Party [class]
#~ #==============================================================================
#~ class Game_Party < Game_Unit
#~   #--------------------------------------------------------------------------
#~   # ○ パーティメンバーの最も低いレベルの取得
#~   #--------------------------------------------------------------------------
#~   def lowest_level
#~     lv = members.collect {|actor| actor.level }.min
#~   end
#~ end

#~ #==============================================================================
#~ # ■ Game_Troop [class]
#~ #==============================================================================
#~ class Game_Troop < Game_Unit
#~   #--------------------------------------------------------------------------
#~   # ○ モジュールの設定
#~   #--------------------------------------------------------------------------
#~   RGSSLAB_132 = RGSSLAB::Get_Exp_UpDown_Setting
#~   #--------------------------------------------------------------------------
#~   # ● 経験値の合計計算 [再定義]
#~   #--------------------------------------------------------------------------
#~   def exp_total
#~     total = dead_members.inject(0) {|r, enemy| r += enemy.exp }
#~     case $game_system.rgsslab132.get_type
#~     when 1
#~       difference = $game_party.highest_level - self.highest_level
#~       if difference == 0
#~         return total
#~       elsif difference > 0 
#~         n = (total * RGSSLAB_132::UPDOWN / 1000.0) * difference
#~         return [Integer(total - n), 0].max
#~       elsif difference < 0
#~         n = (total * RGSSLAB_132::UPDOWN / 1000.0) * -difference
#~         return [Integer(total + n), Integer(total + total * RGSSLAB_132::MAX / 1000.0)].min
#~       end
#~     when 2
#~       difference = $game_party.lowest_level - self.lowest_level
#~       if difference == 0
#~         return total
#~       elsif difference > 0 
#~         n = (total * RGSSLAB_132::UPDOWN / 1000.0) * difference
#~         return [Integer(total - n), 0].max
#~       elsif difference < 0
#~         n = (total * RGSSLAB_132::UPDOWN / 1000.0) * -difference
#~         return [Integer(total + n), Integer(total + total * RGSSLAB_132::MAX / 1000.0)].min
#~       end
#~     when 3
#~       alv = evl = 0
#~       for actor in $game_party.members do alv += actor.level end
#~       if $rgsslab["敵レベル実装"]
#~         for enemy in $game_troop.members do elv += enemy.level end
#~       else
#~         evl = 1
#~       end
#~       difference = alv - elv
#~       if difference == 0
#~         return total
#~       elsif difference > 0 
#~         n = (total * RGSSLAB_132::UPDOWN / 1000.0) * difference
#~         return [Integer(total - n), 0].max
#~       elsif difference < 0
#~         n = (total * RGSSLAB_132::UPDOWN / 1000.0) * -difference
#~         return [Integer(total + n), Integer(total + total * RGSSLAB_132::MAX / 1000.0)].min
#~       end
#~     else
#~       return total
#~     end
#~   end
#~   #--------------------------------------------------------------------------
#~   # ○ 敵メンバーの最も高いレベルの取得
#~   #--------------------------------------------------------------------------
#~   def highest_level
#~     if $rgsslab["敵レベル実装"]
#~       lv = members.collect {|enemy| enemy.level }.max
#~     else
#~       return 1
#~     end
#~   end
#~   #--------------------------------------------------------------------------
#~   # ○ 敵メンバーの最も低いレベルの取得
#~   #--------------------------------------------------------------------------
#~   def lowest_level
#~     if $rgsslab["敵レベル実装"]
#~       lv = members.collect {|enemy| enemy.level }.min
#~     else
#~       return 1
#~     end
#~   end
#~ end

#~ end

